{
  "backend/main.mo": "Motoko canister managing user profiles, artist data, media items, donations, and Stripe configuration using AccessControl, storage mixins, and various query/update calls.",
  "feature_evidence.json": "Empty feature evidence report JSON with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their roles in styling, routing, components, hooks, and pages.",
  "frontend/index.css": "Tailwind base styles with OKLCH color variables for light/dark themes and global element styling.",
  "frontend/index.html": "HTML entry point defining root mount element and loading the main React script.",
  "frontend/src/App.tsx": "Sets up React Router routes, global layout, theme provider, and toaster notifications.",
  "frontend/src/components/artist/ArtistOnboarding.tsx": "Dialog form for creating or editing artist profiles with avatar upload and progress tracking.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with loading states and cache clearing.",
  "frontend/src/components/donations/DonateDialog.tsx": "Donation modal allowing preset/custom amounts and Stripe checkout session creation.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing header, main content area, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright and Caffeine.ai attribution with dynamic year.",
  "frontend/src/components/layout/Header.tsx": "Responsive site header with navigation links and login button, adjusting displayed items based on authentication.",
  "frontend/src/components/media/MediaCard.tsx": "Displays a media item card with thumbnail or playback, artist info, tags, and optional donation button.",
  "frontend/src/components/media/MediaGrid.tsx": "Responsive grid layout wrapper for displaying media cards.",
  "frontend/src/components/media/MediaPlayback.tsx": "Renders video or audio playback UI based on media category, with fallback for missing files.",
  "frontend/src/components/media/MediaUploadForm.tsx": "Handles selecting, editing, and uploading multiple media files with progress tracking and metadata inputs.",
  "frontend/src/components/search/SearchBar.tsx": "Simple search input with icon and change handler.",
  "frontend/src/components/stripe/StripeConnectionCard.tsx": "Manages Stripe connection state, allowing artists to connect or disconnect their Stripe account.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status helpers. Wraps AuthClient with custom options and exposes identity state to the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user, artist, and media data through the actor API. Supports profile updates, artist onboarding, media retrieval, and related state management.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables, light/dark palettes, and global styling rules. Includes base layer resets and custom utilities.",
  "frontend/src/main.tsx": "Initializes the React app by mounting QueryClientProvider and InternetIdentityProvider around the root App component. Loads global CSS and creates the root render target.",
  "frontend/src/pages/artist/ArtistPage.tsx": "Shows an artist’s profile, external links, donation status, and uploaded media with loading and missing-artist handling. Fetches artist details and related media by artist ID.",
  "frontend/src/pages/browse/CategoryBrowsePage.tsx": "Lists media filtered by category and search query with category-specific metadata and icons. Handles loading, error, and empty states using enriched media data.",
  "frontend/src/pages/dashboard/ArtistDashboard.tsx": "Artist dashboard wrapper handling auth, profile loading, onboarding, and tab navigation for home, media, and donations.",
  "frontend/src/pages/dashboard/DashboardDonations.tsx": "Displays donation stats, recent donations placeholder, and per‑item donation breakdown based on the artist’s media.",
  "frontend/src/pages/dashboard/DashboardHome.tsx": "Shows artist profile info, edit dialog, stats, external links, and media count with quick-access actions.",
  "frontend/src/pages/dashboard/DashboardMedia.tsx": "Media management page allowing uploads, listing items, and deleting media with category labels and icons.",
  "frontend/src/pages/LandingPage.tsx": "Displays the landing page with hero content, category cards, and a preview of recent media. Fetches enriched media and adapts UI based on authentication state.",
  "frontend/src/pages/payments/PaymentFailure.tsx": "Displays a cancelled payment message with navigation options after a failed donation attempt.",
  "frontend/src/pages/payments/PaymentSuccess.tsx": "Shows a success message for completed donations and invalidates related queries, offering navigation links.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for getting, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s overall state, including schema versions, platform summary, architectural notes, and a list of implemented features with associated requirements."
}