{
  "backend/main.mo": "Motoko canister implementing artist profiles, media uploads, donation handling, and Stripe integration with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs with high-confidence metadata.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose and behavior of various frontend files and components.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions establishing light/dark theme color tokens and base styling rules.",
  "frontend/index.html": "Minimal HTML entrypoint loading the root React application via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, theming, and top-level application routes including landing, browse, artist, dashboard, and payment pages.",
  "frontend/src/components/artist/ArtistOnboarding.tsx": "Modal form allowing artists to create or update profiles with avatar upload, bio, links, and validation.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing on logout.",
  "frontend/src/components/donations/DonateDialog.tsx": "Donation dialog that collects amount, optional name and message, then creates a Stripe checkout session and redirects the user.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout component rendering header, footer, and main content region.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying copyright info and a referral link with branding.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with navigation links, authentication button, and mobile menu.",
  "frontend/src/components/media/MediaCard.tsx": "Displays a media item with thumbnail, artist info, tags, and an optional donate button with dialog.",
  "frontend/src/components/media/MediaGrid.tsx": "Grid layout wrapper for displaying media cards.",
  "frontend/src/components/media/MediaUploadForm.tsx": "Form allowing artists to upload media files with metadata and track upload progress.",
  "frontend/src/components/search/SearchBar.tsx": "Search input field with an icon and change handler.",
  "frontend/src/components/stripe/StripeConnectionCard.tsx": "Card interface for connecting, viewing, or revoking an artist’s Stripe access token.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and loading stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating artist, media, and related backend data using the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles, theme variables, and dark mode overrides.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up query and identity providers around the root component.",
  "frontend/src/pages/artist/ArtistPage.tsx": "Displays an artist profile with avatar, bio, links, and their uploaded media, handling loading and empty states.",
  "frontend/src/pages/browse/CategoryBrowsePage.tsx": "Displays media for a selected category with search filtering and category-specific metadata.",
  "frontend/src/pages/dashboard/ArtistDashboard.tsx": "Shows the authenticated artist’s dashboard, onboarding flow, and tabs for overview, media, and donations.",
  "frontend/src/pages/dashboard/DashboardDonations.tsx": "Displays donation stats and media-based donation breakdown, currently showing placeholders.",
  "frontend/src/pages/dashboard/DashboardHome.tsx": "Shows the artist’s profile, quick stats, external links, and provides profile editing.",
  "frontend/src/pages/dashboard/DashboardMedia.tsx": "Lets artists upload, view, and delete their media with category labels and tags.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing hero content, media categories, and recent media with authentication-aware actions.",
  "frontend/src/pages/payments/PaymentFailure.tsx": "Shows a cancelled payment message with navigation options back to home or browsing.",
  "frontend/src/pages/payments/PaymentSuccess.tsx": "Shows a successful payment message and invalidates related queries before offering navigation options.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, typography, animations, and plugin setup.",
  "project_state.json": "Project metadata describing the platform’s purpose, current features, architecture notes, and required images."
}